# GetParametersManager Method (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
RebarContainer..::..GetParametersManager Method
RebarContainer Class See Also
---
Returns an object used to manage parameters of the Rebar Container.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)**Since:** 2016
# Syntax
C#
---
```text
public RebarContainerParameterManager GetParametersManager()
```

Visual Basic
---
```text
Public Function GetParametersManager As RebarContainerParameterManager
```

Visual C++
---
```text
public:
RebarContainerParameterManager^ GetParametersManager()
```

# ### Return Value
The parameters manager.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..DisabledDisciplineException | None of the following disciplines is enabled: Structural. |

# See Also
RebarContainer Class
Autodesk.Revit.DB.Structure Namespace